# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingCriterionBase..::..IsEqual Method
RoutingCriterionBase Class See Also
---
Verify if two criteria are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsEqual(
	RoutingCriterionBase pOther
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	pOther As RoutingCriterionBase _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	RoutingCriterionBase^ pOther
)
```

# ### Parameters
pOther
    Type: Autodesk.Revit.DB..::..RoutingCriterionBase
# ### Return Value
True if the criterion is equal to the other, false otherwise
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace